## PART I

##### 1. Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

In [11]:
#Done!
import env
import pandas as pd
import numpy as np

##### 2. cd into your exercises folder for this module and run echo env.py >> .gitignore

In [5]:
#Done!

##### 3. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [23]:
def get_db_url(user,host,password,schema):
    return f'mysql+pymysql://{user}:{password}@{host}/{schema}'

##### 4. Use your function to obtain a connection to the employees database.

In [24]:
conn = get_db_url(env.user, env.host, env.password, 'employees')

##### 5. Once you have successfully run a query:

In [27]:
q1 = '''
    SELECT
        first_name,
        last_name,
        emp_no
    FROM employees
    ORDER BY last_name
    LIMIT 10
'''

In [28]:
df = pd.read_sql(q1, conn)
df

  first_name last_name  emp_no
0     Bartek    Aamodt   11761
1     Aluzio    Aamodt   15427
2     Dekang    Aamodt   18182
3       Matt    Aamodt   16572
4    Mokhtar    Aamodt   12791
5  Sreenivas    Aamodt   12516
6     Sachem    Aamodt   12982
7      Basim    Aamodt   17400
8      Vidar    Aamodt   19898
9   Takanari    Aamodt   17885

##### 5.a. Intentionally make a typo in the database url. What kind of error message do you see?

In [22]:
#used 'empoyees' instead of 'employees' 
#returns (1044, "Access denied for user to database 'empoyees'")

##### 5.b. Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
#used ORDERBY instead of ORDER BY
#returns (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'last_name\n    LIMIT 10' at line 6")

##### 6. Read the employees and titles tables into two separate DataFrames.

In [29]:
emps = '''
    SELECT *
    FROM employees
'''

titles = '''
    SELECT *
    FROM titles
'''

In [30]:
emps_df = pd.read_sql(emps, conn)
titles_df = pd.read_sql(titles, conn)

##### 7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [31]:
emps_df.shape

(300024, 6)

In [32]:
titles_df.shape

(443308, 4)

##### 8. Display the summary statistics for each DataFrame.

In [33]:
emps_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [34]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

##### 9. How many unique titles are in the titles DataFrame?

In [36]:
len(titles_df.title.unique())

7

##### 10. What is the oldest date in the to_date column?

In [40]:
titles_df['to_date'].min()

datetime.date(1985, 3, 1)

##### 11. What is the most recent date in the to_date column?

In [43]:
titles_df['to_date'].max()

datetime.date(9999, 1, 1)

## PART II

##### 1. Copy the users and roles DataFrames from the examples above.

In [45]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [46]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

##### 2. What is the result of using a right join on the DataFrames?

In [52]:
users.merge(roles, left_on='role_id', right_on='id', how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

##### 3. What is the result of using an outer join on the DataFrames?

In [53]:
users.merge(roles, left_on='role_id', right_on='id', how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

##### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [59]:
u2 = users.drop(columns='role_id')
u2.merge(roles, left_on='id', right_on='id', how='outer')

   id name_x     name_y
0   1    bob      admin
1   2    joe     author
2   3  sally   reviewer
3   4   adam  commenter
4   5   jane        NaN
5   6   mike        NaN

##### 5. Load the mpg dataset from PyDataset.

In [60]:
from pydataset import data
mpg = data('mpg')

##### 6. Output and read the documentation for the mpg dataset.

In [61]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

##### 7. How many rows and columns are in the dataset?

In [62]:
mpg.shape

(234, 11)

##### 8. Check out your column names and perform any cleanup you may want on them.

In [65]:
mpg = mpg.rename(columns={'cty' : 'city', 'hwy': 'highway', 'trans': 'transmission'})
mpg.head()

,manufacturer,model,displ,year,cyl,transmission,drv,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

##### 9. Display the summary statistics for the dataset.

In [66]:
mpg.describe()

            displ         year         cyl        city     highway
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

##### 10. How many different manufacturers are there?

In [67]:
len(mpg.manufacturer.unique())

15

##### 11. How many different models are there?

In [68]:
len(mpg.model.unique())

38

##### 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [69]:
mpg['mileage_difference'] = mpg.highway - mpg.city
mpg.head()

,manufacturer,model,displ,year,cyl,transmission,drv,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

##### 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [70]:
mpg['avg_mileage'] = (mpg.highway+mpg.city)/2
mpg.head()

,manufacturer,model,displ,year,cyl,transmission,drv,city,highway,fl,class,mileage_difference,avg_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

##### 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [71]:
mpg['is_automatic'] = mpg.transmission.str.contains('auto')
mpg.head()

,manufacturer,model,displ,year,cyl,transmission,drv,city,highway,fl,class,mileage_difference,avg_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

##### 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [72]:
mpg[mpg.avg_mileage == mpg.avg_mileage.max()]

,manufacturer,model,displ,year,cyl,transmission,drv,city,highway,fl,class,mileage_difference,avg_mileage,is_automatic
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,9,39.5,False

##### 16. Do automatic or manual cars have better miles per gallon?

In [77]:
mpg.groupby('is_automatic').avg_mileage.mean()

is_automatic
False    22.227273
True     19.130573
Name: avg_mileage, dtype: float64

## PART III

##### 1. Use your get_db_url function to help you explore the data from the chipotle database.

##### 2. What is the total price for each order?

##### 3. What are the most popular 3 items?

##### 4. Which item has produced the most revenue?

##### 5. Join the employees and titles DataFrames together.

##### 6. For each title, find the hire date of the employee that was hired most recently with that title.

##### 7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)